.. _wkn_userguide:

WKN Strings
============

Introduction
------------

The function :func:`clean_de_wkn() <dataprep.clean.clean_de_wkn.clean_de_wkn>` cleans a column containing German Securities Identification Codes (WKN) strings, and standardizes them in a given format. The function :func:`validate_de_wkn() <dataprep.clean.clean_de_wkn.validate_de_wkn>` validates either a single WKN strings, a column of WKN strings or a DataFrame of WKN strings, returning `True` if the value is valid, and `False` otherwise.

WKN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "A0MNRK"
* `standard`: WKN strings with proper whitespace in the proper places. Note that in the case of WKN, the compact format is the same as the standard one.
* `isin`: convert the number to an ISIN, like "DE000A0MNRK9".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_de_wkn()` and `validate_de_wkn()`.

### An example dataset containing WKN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "wkn": [
            'A0MNRK',
            'AOMNRK',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          wkn                                           address
0      A0MNRK                                     123 Pine Ave.
1      AOMNRK                                           main st
2  7542011030                      1234 west main heights 57033
3  7552A10004                    apt 1 789 s maple rd manhattan
4  8019010008                robie house, 789 north main street
5       hello         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NULL                                             hello

## 1. Default `clean_de_wkn`

By default, `clean_de_wkn` will clean wkn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_de_wkn
clean_de_wkn(df, column = "wkn")

          wkn                                           address wkn_clean
0      A0MNRK                                     123 Pine Ave.    A0MNRK
1      AOMNRK                                           main st       NaN
2  7542011030                      1234 west main heights 57033       NaN
3  7552A10004                    apt 1 789 s maple rd manhattan       NaN
4  8019010008                robie house, 789 north main street       NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles       NaN
7        NULL                                             hello       NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_de_wkn(df, column = "wkn", output_format="standard")

          wkn                                           address wkn_clean
0      A0MNRK                                     123 Pine Ave.    A0MNRK
1      AOMNRK                                           main st       NaN
2  7542011030                      1234 west main heights 57033       NaN
3  7552A10004                    apt 1 789 s maple rd manhattan       NaN
4  8019010008                robie house, 789 north main street       NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles       NaN
7        NULL                                             hello       NaN

### `compact`

In [4]:
clean_de_wkn(df, column = "wkn", output_format="compact")

          wkn                                           address wkn_clean
0      A0MNRK                                     123 Pine Ave.    A0MNRK
1      AOMNRK                                           main st       NaN
2  7542011030                      1234 west main heights 57033       NaN
3  7552A10004                    apt 1 789 s maple rd manhattan       NaN
4  8019010008                robie house, 789 north main street       NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles       NaN
7        NULL                                             hello       NaN

### `isin`

In [5]:
clean_de_wkn(df, column = "wkn", output_format="isin")

          wkn                                           address     wkn_clean
0      A0MNRK                                     123 Pine Ave.  DE000A0MNRK9
1      AOMNRK                                           main st           NaN
2  7542011030                      1234 west main heights 57033           NaN
3  7552A10004                    apt 1 789 s maple rd manhattan           NaN
4  8019010008                robie house, 789 north main street           NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015           NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles           NaN
7        NULL                                             hello           NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned WKN strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_de_wkn(df, column="wkn", inplace=True)

  wkn_clean                                           address
0    A0MNRK                                     123 Pine Ave.
1       NaN                                           main st
2       NaN                      1234 west main heights 57033
3       NaN                    apt 1 789 s maple rd manhattan
4       NaN                robie house, 789 north main street
5       NaN         1111 S Figueroa St, Los Angeles, CA 90015
6       NaN  (staples center) 1111 S Figueroa St, Los Angeles
7       NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_de_wkn(df, "wkn", errors="coerce")

          wkn                                           address wkn_clean
0      A0MNRK                                     123 Pine Ave.    A0MNRK
1      AOMNRK                                           main st       NaN
2  7542011030                      1234 west main heights 57033       NaN
3  7552A10004                    apt 1 789 s maple rd manhattan       NaN
4  8019010008                robie house, 789 north main street       NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles       NaN
7        NULL                                             hello       NaN

### `ignore`

In [8]:
clean_de_wkn(df, "wkn", errors="ignore")

          wkn                                           address   wkn_clean
0      A0MNRK                                     123 Pine Ave.      A0MNRK
1      AOMNRK                                           main st      AOMNRK
2  7542011030                      1234 west main heights 57033  7542011030
3  7552A10004                    apt 1 789 s maple rd manhattan  7552A10004
4  8019010008                robie house, 789 north main street  8019010008
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       hello
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

## 4. `validate_de_wkn()`

`validate_de_wkn()` returns `True` when the input is a valid WKN. Otherwise it returns `False`.

The input of `validate_de_wkn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_de_wkn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_de_wkn()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_de_wkn
print(validate_de_wkn('A0MNRK'))
print(validate_de_wkn('AOMNRK'))
print(validate_de_wkn('7542011030'))
print(validate_de_wkn('7552A10004'))
print(validate_de_wkn('8019010008'))
print(validate_de_wkn("hello"))
print(validate_de_wkn(np.nan))
print(validate_de_wkn("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_de_wkn(df["wkn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: wkn, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_de_wkn(df, column="wkn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: wkn, dtype: bool

### Only DataFrame

In [12]:
validate_de_wkn(df)

     wkn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False